{
    "brief": "Get next journal entry for consumer",
    "category": "journal",
    "description": "Get the next journal entry for a consumer referenced by the consumer_id parameter. The entry_cursor parameter is ignored. The limit parameter specifies the maximum number of entries to scan for an applicable entry for consumer before returning.\n\n This option will set response properties 'entry' and 'entryCursor' if an applicable entry is retrieved. Property 'reissue' will be set as described below.\n\nThe properties of the _AdaptiveProvisioningPeer_ object associated with the consumer_id are used in the following way:\n\nThe consumerFilter expression is used to determine if an entry is applicable.\n\nIf consumeCursor property exists, return that entry at that cursor again immediately with a 'reissue' property added and set to true.\n\nJournal entries are scanned beginning at the entry at the cursor in the advanceCursor property. If the advanceCursor property is not present, the scan begins after the cursor in currentCursor. If neither are present, the scan begins at the start of the journal.\n\nIf an applicable entry is found, properties consumeStart and consumeCursor are set, advanceCursor is removed, and the entry is returned. Method mark_entry_consumed() will remove these properties.\n\nIf no applicable entry is found, advanceCursor is set to the last entry scanned.",
    "functionId": "journal_get_next_for_consumer",
    "functionLabel": "journal_get_next_for_consumer",
    "parameters": [
        {
            "dataType": "string",
            "description": "Id of adaptor.",
            "name": "adaptorId"
        },
        {
            "dataType": "string",
            "description": "The consumerId property value of the associated _AdaptiveProvisioningPeer_ object.",
            "name": "consumerId"
        },
        {
            "dataType": "integer",
            "description": "The maximum number of entries that will be scanned for an entry where the consumerFilter expression in the associated _AdaptiveProvisioningPeer_ object evaluates to true.",
            "name": "limit",
            "optional": true
        }
    ],
    "returns": {
        "dataType": "object",
        "description": "Response object."
    }
}